&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ООбъект = РеквизитФормыВЗначение("Объект");	
	
	КаталогПесочницы = ПолучитьИмяКаталога(ПолучитьИмяФайлаОбработки());  
	ИмяФайлаЛога = КаталогПесочницы + "logs/benchmark_1c.log";

	ООбъект.ЗапуститьРешениеОбертка(ИмяФайлаЛога);  
	
КонецПроцедуры        

Функция ПолучитьИмяКаталога(ПолноеИмя) 
	
	Ном = СтрДлина(ПолноеИмя);
	Пока Ном > 0 Цикл
	   Символ = Сред(ПолноеИмя, Ном, 1);
	   Если Символ <> "\" Тогда
	       Ном = Ном - 1;  
	   Иначе
	       Прервать;
	   КонецЕсли;
	КонецЦикла;
	Каталог = Лев(ПолноеИмя, Ном);

	Возврат Каталог; 

КонецФункции    

&НаСервере
Функция ПолучитьИмяФайлаОбработки() 
	
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Возврат ОбработкаОбъект.ИспользуемоеИмяФайла;     
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	 
	ЗавершитьРаботуСистемы(Ложь);   
	
КонецПроцедуры
