Процедура ЗаписатьВЛог(ТекстСообщения, ПутьКЛогу)
	Стр = ТекстСообщения;
	Попытка
		Запись = Новый ЗаписьТекста(ПутьКЛогу, КодировкаТекста.UTF8);
		Запись.ЗаписатьСтроку(Стр);
		Запись.Закрыть();
	Исключение
		ТД = Новый ТекстовыйДокумент;
		ФайлЛога = Новый Файл(ПутьКЛогу);
		Если ФайлЛога.Существует() Тогда
			ТД.Прочитать(ПутьКЛогу, КодировкаТекста.UTF8);
		КонецЕсли;

		ТД.ДобавитьСтроку(Стр);
		ТД.Записать(ПутьКЛогу, КодировкаТекста.UTF8);
	КонецПопытки;
КонецПроцедуры

Функция ЗапуститьРешениеОбертка(ПутьКЛогу) Экспорт
	Попытка
		Результат = ЗапуститьРешение();
        ЗаписатьВЛог("Result: " + ?(Результат, "true", "false"), ПутьКЛогу);
	Исключение
		Инф = ИнформацияОбОшибке();
		Сообщение = Инф.Описание;
		Если Инф.Причина <> Неопределено Тогда
			Сообщение = Сообщение + ": " + Инф.Причина.Описание;
		КонецЕсли;
		ЗаписатьВЛог("Error: " + Сообщение, ПутьКЛогу);
	КонецПопытки;
КонецФункции

